{
  "chapter": "chapter_1",
  "chapter_title": "第一章 — ノメイアの危機",
  "chapter_description": "遺跡からノメイアの町へ。そこであなたが見たのは、名折れが町そのものを蝕んでいく様子だった。",
  "beacons": [
    {
      "beacon_order": 1,
      "beacon_id": "chapter1_01_resonance",
      "title": "ティアラとの呼応",
      "location": "ノメイア — 森の入口",
      "content": "遺跡を出たあなたたちは、やがて森の奥から光の見える場所へ出てきた。\n\nティアラは、古い石造りの道を進む。その道は、かつて多くの者が歩んだであろう跡が見える。だが、今は草が茂り、誰も近付かなくなったものばかりだ。\n\n「この道は、かつてノメイアとの交易路でした。百年前は、毎日のように商人が往来していた。呼応石を求める者たちの行列が、途切れることなく...」\n\nティアラの言葉は、そこで途切れた。その瞳は遠い過去を見つめているようだった。\n\nあなたが、ティアラのそばを歩むと、不思議なことに、二人の足運びが自然に一致し始めた。あなたが左足を出す時、ティアラも同じリズムで歩む。あなたが躊躇すると、ティアラも同じように速度を落とす。\n\n「これは...」あなたが、その不思議な同期に気付いて呟くと、ティアラは振り返った。\n\n「呼応（こおう）です。あなたと私が、同じ心を持つようになると、自然に起こることなんです。これが、本来の『呼応』なんですよ。石が光るのは、この呼応が起こった時だけなんです」\n\nティアラは、あなたの手に自分の頭を押し付けた。その時、あなたの心に、もう一つの記憶の断片が浮かんだ。それは、過去の何か——だが、あまりに不鮮明で、理解できない。\n\n「あなたは、すでに私と呼応し始めています。だから...もう一人ではないんです。その証が、この同期なんです。大切にしてください。名折れの時代に、こうした呼応こそが、唯一の光なんですから」\n\nあなたたちは、やがて森の端に到達した。その先は、町だ。ノメイアの町。\n\nだが、その光景は、あなたの期待を大きく裏切るものだった。",
      "tiara_dialogue": "「この道は、かつてノメイアとの交易路でした。百年前は、毎日のように商人が往来していた。呼応石を求める者たちの行列が、途切れることなく...これが、本来の『呼応』なんですよ。あなたと私が、同じ心を持つようになると、自然に起こることなんです。石が光るのは、この呼応が起こった時だけなんです」",
      "character_insights": {
        "tiara": "ティアラは、あなたとの『呼応』を重視している。これは、単なる フレーバーテキストではなく、ティアラ信頼度システムの具体的な表現である。あなたたちのリズムが同期することで、物理的にも心理的にも繋がっていることが示される。",
        "echo": "プレイヤーは、『呼応』の概念を理解する。これは、この世界の中心的なメカニズムであり、今後のストーリー理解の基礎となる。"
      },
      "choices": [
        {
          "choice_id": "ch1_resonate_embrace",
          "choice_text": "ティアラに抱きしめられ、そのぬくもりを感じ入る",
          "choice_description": "この繋がりを、完全に受け入れたいという想い。",
          "narrative_result": "あなたは、ティアラを抱き上げた。その時、世界全体が一瞬、淡い紫色に包まれた。あなたの心に、より強い記憶の光が走る——それは、あなたがティアラを抱きしめていた過去だ。ティアラは、その中で涙をこぼしていたようだった。「あああ...あなた...あなたは...本当に」",
          "affinity_delta": {
            "tiara_trust": 12,
            "logic_empathy_balance": 10,
            "name_memory_stability": 5
          }
        },
        {
          "choice_id": "ch1_resonate_question",
          "choice_text": "『呼応とは何か』と深く質問する",
          "choice_description": "その現象を、理性的に理解したいという欲求。",
          "narrative_result": "あなたが詳しく尋ねると、ティアラは一度目を伏せた。その後、ゆっくりと説明を始めた。「呼応とは...二つの心が、同じ周波数を持つようになることです。物理的には説明できません。ただ...本当に大切な者同士にしか、起こらないものなんです」その説明は、科学的ではないが、深い何かを感じさせた。",
          "affinity_delta": {
            "tiara_trust": 8,
            "logic_empathy_balance": -5,
            "name_memory_stability": 8
          }
        },
        {
          "choice_id": "ch1_resonate_hesitate",
          "choice_text": "ティアラの抱きしめを受けながらも、何か違和感を覚える",
          "choice_description": "何かが不自然だという直感。あるいは、過去への恐れ。",
          "narrative_result": "あなたは、ティアラのぬくもりを感じながらも、心のどこかで引き返そうとしている自分がいることに気付いた。ティアラは、その迷いを察知したようだ。「あ...そう。あなたは、まだ怖いんですね。でも、大丈夫です。その怖さも含めて...あなたなんですから」その言葉に、あなたは一層の不安を感じた。何が怖いのか、自分でもわかっていないから。",
          "affinity_delta": {
            "tiara_trust": -3,
            "logic_empathy_balance": 3,
            "name_memory_stability": -5
          }
        }
      ],
      "beacon_summary": "あなたとティアラの間に『呼応』という概念的な繋がりが生まれ始める。これは、単なるゲーム的パラメータではなく、物語の根底を形成するものである。"
    },
    {
      "beacon_order": 2,
      "beacon_id": "chapter1_02_arrival",
      "title": "ノメイアへの到着",
      "location": "ノメイア — 町の中央広場",
      "content": "ノメイアの町に入ったあなたは、すぐにその異変に気付く。\n\n町は、確かに存在している。建物も、道も、橋も。だが、それらすべてが、薄い透明性に包まれているかのように見える。まるで、誰かが半分だけ忘れかけている世界のようだ。\n\nそして、人間がいない。\n\nいや、完全にいないわけではない。所々に、人影がある。だが、その人影は、あなたを見ていない。見ていても、認識していないのだ。あなたが直接その人に話しかけようとしても、その人は「誰かがここにいるかもしれない」という朧げな感覚を持つだけで、あなたという存在を認識できないのである。\n\n「名折れが、進行しているんです」\n\nティアラの声には、悲しみが漏れていた。\n\n「この町にいる人々は、みな、自分たちが『誰なのか』を忘れ始めています。名前が薄れると、存在そのものが薄れる。やがて...本当に誰もが忘れてしまう」\n\nあなたたちが町の中央広場に出ると、そこには一つの異変が見えた。かつて、呼応石があったであろう台座の上に、もはや光るものは何もない。だが、その台座の周りには、数えきれないほどのカケラが散らばっていた。\n\nそれは、失われた人々の記憶の破片だ。\n\nティアラは、静かにそのカケラの一つを拾い上げた。その瞬間、古い映像があなたの心に流れ込んできた。\n\n——それは、一人の老人だ。ノメイアの長老。その人は、あなたを見つめていた。あなたに何か大切なことを言おうとしていた。だが、言葉は完成しない前に、老人の姿は薄れてゆき、世界から消える。\n\n「この人は...誰ですか」\n\nあなたが、ティアラに尋ねた。\n\n「名前を失ってしまった人です。こうなると、誰も彼を覚えていません。誰も、彼が誰だったのか、知ることができません。彼は、本当の意味で、存在しなくなるんです」\n\nティアラは、カケラを握りしめた。その瞳には、深い怒りと、同じくらい深い悲しみがあった。\n\n「だから...私たちが、カケラを集めるんです。誰かを完全には忘れないために。この記憶の断片を、どこかに保存するために。もし、すべてのカケラが失われたら...この世界は、完全に誰のものでもない世界になってしまいます」",
      "tiara_dialogue": "「名折れが、進行しているんです。この町にいる人々は、みな、自分たちが『誰なのか』を忘れ始めています。名前が薄れると、存在そのものが薄れる。やがて...本当に誰もが忘れてしまう。だから...私たちが、カケラを集めるんです。誰かを完全には忘れないために」",
      "character_insights": {
        "tiara": "ティアラが、カケラを握った時、彼女の表情が大きく変わった。それは、彼女が深く個人的に、この危機に関わっていることを示唆している。彼女は、単なるガイドではなく、この物語の当事者なのだ。",
        "echo": "プレイヤーが見た『老人の記憶フラッシュ』は、第一章の重要なプロット要素である。この老人は誰なのか、そして、なぜあなたを見つめていたのか——それは、物語が進むにつれて明かされるであろう。"
      },
      "choices": [
        {
          "choice_id": "ch1_arrival_collect",
          "choice_text": "すぐにカケラの収集を始める",
          "choice_description": "失われた記憶を守ることに、強い義務感を感じる。",
          "narrative_result": "あなたは、広場に散らばっているカケラを一つずつ集め始めた。そのたびに、失われた人々の記憶の断片があなたを通り抜ける。悲しみ、喜び、愛、恐れ——数多くの感情が、あなたの心を波打たせた。ティアラは、そんなあなたを黙って見守りながら、自分も静かにカケラを集めていった。あなたたちの間に、言葉のない了解が生まれていた。",
          "affinity_delta": {
            "tiara_trust": 8,
            "logic_empathy_balance": 10,
            "fragment_count": 3
          }
        },
        {
          "choice_id": "ch1_arrival_question",
          "choice_text": "なぜこのようなことが起こっているのか、根本原因を尋ねる",
          "choice_description": "この現象の『なぜ』を理解したい。",
          "narrative_result": "あなたが原因を尋ねると、ティアラは一度虚空を見つめた。「それが...私にもはっきりとは分かっていないんです。ただ...何かが、このシステムを破壊し始めたのだと思います。名前の力が、どこかへ流れ出してしまっているのだと」その言葉には、不安と、隠された知識が混在していた。",
          "affinity_delta": {
            "tiara_trust": 2,
            "logic_empathy_balance": -8,
            "name_memory_stability": 3
          }
        },
        {
          "choice_id": "ch1_arrival_accept",
          "choice_text": "この状況を静かに受け入れ、ティアラに従う",
          "choice_description": "理解を求めるのではなく、現実を直視する。",
          "narrative_result": "あなたは、深く息を吸った。そして、その悲しみを受け入れることにした。ティアラを見ると、彼女も同じように息を吸っていた。「そう...あなたは、いつもそうだった。言葉ではなく、行動で示す者」その時、あなたたちの心に、初めて確かな『呼応』が生まれた。",
          "affinity_delta": {
            "tiara_trust": 10,
            "logic_empathy_balance": 8,
            "name_memory_stability": -3,
            "fragment_count": 2
          }
        }
      ],
      "beacon_summary": "プレイヤーは、名折れの具体的な影響を目の当たりにし、物語の真のスケールを理解し始める。カケラ収集というゲーム的メカニズムも、物語的な意味を帯び始める。"
    },
    {
      "beacon_order": 3,
      "beacon_id": "chapter1_03_crisis",
      "title": "名折れの危機",
      "location": "ノメイア — 旧教会跡",
      "content": "あなたたちは、カケラを集めながら、町の奥深くへ進む。\n\nやがて、あなたたちが到達した場所は、古い教会だった。だが、その教会は、もはや『教会』であることをやめかけていた。壁は曖昧に見え、床は不確かに揺らいでいる。時折、建物全体が「本当にここにあるのか」という問いを発しているかのように見えた。\n\nその教会の中心に、一人の人間がいた。\n\nそれは、ノメイアの長老だ——あなたがカケラから見た、あの人物だ。だが、その人は、半分ほど存在が薄れてしまっていた。半透明の身体。途切れ途切れの声。\n\n「ああ...あなたたちが...来てくれたのね...」\n\nティアラは、その長老を見ると、一度身を硬くした。そして、すぐに走り寄った。\n\n「長老...どうして、まだここに...」\n\n「存在を保つために...呼応石の力を使って...ここに...留まっている...」\n\nその長老の声は、かすかで、風のようだ。\n\n「でも...もう...限界だ...呼応石の力も...尽きかけている...私も...やがて...」\n\nその時、長老の視線があなたに向けられた。その瞳には、かすかな光が灯っていた。\n\n「あなた...あなたなのね...やっと...あなたが...戻ってきた...」\n\nあなたは、その言葉に、衝撃を受けた。この人は、あなたを知っているのだ。あなたは、この人を知らないのに。\n\n「あなたが...取り戻さねばならん...」\n\n長老の声は、ますます小さくなる。\n\n「呼応石の...真の目的を...名前の力が...本来は...どこにあるのかを...」\n\nティアラは、長老に寄り添った。その表情は、あなたがこれまで見たことのないほど、悲しみに満ちていた。\n\n「長老...どうすれば...」\n\n「あなたたちが...カケラを集めて...呼応を深めれば...やがて...その答えも...」\n\nその時、教会の壁が一度大きく揺らいだ。長老は、その中に消えかけようとしていた。\n\n「待たせてくれ...もう少し...私は...あなたたちに...」\n\nだが、時間は容赦しない。\n\n長老は、その言葉を完成させる前に、光へと消えていった。後に残されたのは、一つの大きなカケラだけ。\n\n「長老...」\n\nティアラは、静かにそのカケラを拾い上げた。\n\n「あなたの...記憶を...守ります...」\n\nティアラの声は、静寂そのものだった。",
      "tiara_dialogue": "「長老...」（その後、沈黙。そして、静かに）「あなたの...記憶を...守ります...」",
      "character_insights": {
        "tiara": "ティアラが、長老に接する態度は、彼女が単なる旅の案内人ではなく、ノメイアの歴史に深く関わっていることを示唆している。また、長老があなたを『知っている』ことで、物語の大きなプロット——プレイヤーの真の正体——への扉が開かれ始める。",
        "echo": "プレイヤーは、自分が何か重要な秘密を持っていることに気付き始める。だが、その秘密が何なのかは、まだ分からない。それは、物語の中盤以降で明かされるべき謎である。"
      },
      "choices": [
        {
          "choice_id": "ch1_crisis_honor",
          "choice_text": "長老の最後の言葉を理解しようと、そのカケラを丁寧に扱う",
          "choice_description": "失われた者への敬意。その記憶を守ることの大切さ。",
          "narrative_result": "あなたは、ティアラの手からそのカケラを受け取ると、両手で丁寧に抱きしめた。その瞬間、長老の最後の思いが、あなたの心に流れ込んできた。『取り戻せ...あなたの名前を...ノメイアの希望を...』その声は、あなたの心の奥底に刻まれた。ティアラは、その光景を見つめながら、涙をこぼしていた。「ありがとう...あなたは...本当に、あなたなんだ」",
          "affinity_delta": {
            "tiara_trust": 15,
            "logic_empathy_balance": 10,
            "fragment_count": 3,
            "name_memory_stability": 5
          }
        },
        {
          "choice_id": "ch1_crisis_question",
          "choice_text": "長老の言葉の『真の意味』を問い詰める",
          "choice_description": "謎を解かずにはいられない。あなたは何なのか。",
          "narrative_result": "あなたが、長老の言葉について強く追及しようとするが、長老はもう存在しない。ティアラは、あなたを見つめた。その瞳には、あなたに真実を告げたいという想いと、それができない理由とが、混在していた。「長老の言葉は...あなたが自分で理解する必要があるんです。私が答えを与えると...それは真実ではなくなってしまう」",
          "affinity_delta": {
            "tiara_trust": 5,
            "logic_empathy_balance": -10,
            "name_memory_stability": -5,
            "fragment_count": 2
          }
        },
        {
          "choice_id": "ch1_crisis_continue",
          "choice_text": "深く考えることをやめて、ティアラと共に前に進む",
          "choice_description": "理解よりも、一緒に歩むことを選ぶ。",
          "narrative_result": "あなたは、カケラを静かに懐に入れ、ティアラのそばに立った。「進みましょう」その一言で、ティアラの表情は光を取り戻した。あなたたちは、教会を静かに後にした。その時、二人の歩みはさらに完全に一致していた。何も言葉を交わさずとも、二人の心は同じ周波数で振動していた。",
          "affinity_delta": {
            "tiara_trust": 12,
            "logic_empathy_balance": 8,
            "name_memory_stability": 3,
            "fragment_count": 3
          }
        }
      ],
      "beacon_summary": "プレイヤーは、名折れの最悪の側面——完全な存在消滅——を目撃する。同時に、自分の正体についての謎が深まり始め、物語の根底にある秘密へと向かう流れが加速する。"
    },
    {
      "beacon_order": 4,
      "beacon_id": "chapter1_04_fragment_acquisition",
      "title": "カケラの獲得",
      "location": "ノメイア — 呼応石の遺跡",
      "content": "あなたたちは、町の奥へ奥へと進んでいく。\n\nやがて、あなたたちが到達した場所は、かつての呼応石採掘場だった。大きな穴が、地下へと続いている。そこの壁には、かつて光を放っていたであろう、呼応石のあとが無数に見える。\n\nだが、今は、どの石も光っていない。\n\nティアラは、その風景を見つめると、深く息をついた。\n\n「ここが...ノメイアの心臓だった...」\n\nその時、あなたは何かの気配を感じた。\n\nそれは、危険な気配ではない。だが、何かの『力』が、この場所に集中しているのを感じた。\n\nあなたが周囲を見回ると、その穴の奥深くから、一つの淡い光が現れた。それは、かすかだが、確実に『呼応石』の光だ。\n\n「あの光...」\n\nティアラが、驚いた声を上げた。\n\n「あの光が応答しているのは...あなたの呼び声に...あなたが、ノメイアのシステムに呼応している...」\n\nあなたは、その光へ向かって歩いた。\n\nすると、地面が揺れ始め、穴の底からゆっくりと、一つの大きな呼応石が浮かび上がってきた。その石は、あなたたちの二人の呼応に応答して、柔らかく光を放っていた。\n\nそして、その石の周りには、数え切れないほどのカケラが浮遊していた。それは、ノメイアの歴史——失われた数百年分の記憶だ。\n\n「これ...これは...」\n\nティアラは、驚愕の表情で、その光景を見つめていた。\n\n「あなた...あなたは...本当に...」\n\nその時、あなたの心に、初めて確かな意識が生まれた。\n\nあなたは、単なる名前のない者ではない。あなたは、何かの『力』を持っている。そしてその力は、この世界の根底に関わっている。\n\nあなたが石に手を触れると、すべてのカケラが一度に、あなたの心へと流れ込んできた。\n\nノメイアの歴史。失われた人々の記憶。そして——あなた自身の、断片化された記憶。\n\nあなたは、見た。\n\nあなたが、かつてこの石と共にいたこと。あなたが、ノメイアの『守り手』だったこと。あなたが、何らかの理由で、記憶を失い、眠りについたこと。\n\n「あなた...あなたは...ノメイアの...」\n\nティアラは、言葉を完成させることができず、ただあなたのそばに寄り添った。\n\nそして、二人の呼応は、その時、最高潮に達した。\n\n一瞬の光が、遺跡全体を包み込んだ。\n\nそこには、もはや二つの個別な存在ではなく、一つの『統一された存在』がいた。",
      "tiara_dialogue": "「あの光が応答しているのは...あなたの呼び声に...あなたが、ノメイアのシステムに呼応している...」（後に）「あなた...あなたは...本当に...」",
      "character_insights": {
        "tiara": "ティアラが、あなたの正体を認識する瞬間。これは、彼女が何を知っていたのか、どうしてあなたを探していたのかが明かされる転換点である。同時に、彼女の悲しみと喜びの入り混じった表情が、彼女の深い愛を示唆している。",
        "echo": "プレイヤーは、自分の断片化された過去の一部を見る。これは、ゲームの大きなプロット転換点であり、第二章へ向かうための必須の発見である。"
      },
      "choices": [
        {
          "choice_id": "ch1_fragment_embrace",
          "choice_text": "すべての記憶を受け入れ、ティアラとの呼応をさらに深める",
          "choice_description": "過去を完全に理解することよりも、未来を一緒に歩むことを選ぶ。",
          "narrative_result": "あなたは、ティアラをぎゅっと抱きしめた。その瞬間、光はさらに強くなり、すべてのカケラがあなたたちの周りで回転し始めた。あなたたちは、記憶の流れの中で、完全に一つの存在となった。過去も未来も、二人で共有する『時間』へと変わった。「あなた...私たち...」ティアラの声は、もはや泣いているのか、笑っているのか、分からないほどだった。",
          "affinity_delta": {
            "tiara_trust": 20,
            "logic_empathy_balance": 12,
            "name_memory_stability": 15,
            "fragment_count": 25
          }
        },
        {
          "choice_id": "ch1_fragment_hesitate",
          "choice_text": "記憶の流入に耐え切れず、一度身を引く",
          "choice_description": "あまりに多くの情報。あまりに急速な変化。理解が追いつかない。",
          "narrative_result": "あなたは、記憶の流れに圧倒され、石から手を離した。その瞬間、光は弱まり、あなたは地に膝をついた。ティアラは、あなたの側に来て、静かに支えていた。「大丈夫...急ぐ必要はありません。あなたが、あなたのペースで思い出せば...それでいいんです。私は、ずっと、ここにいますから」その言葉に、あなたは感謝と同時に、深い申し訳なさを感じた。",
          "affinity_delta": {
            "tiara_trust": 8,
            "logic_empathy_balance": 5,
            "name_memory_stability": 5,
            "fragment_count": 15
          }
        },
        {
          "choice_id": "ch1_fragment_analyze",
          "choice_text": "記憶の流れを慎重に分析し、理性的に理解しようとする",
          "choice_description": "混乱ではなく、体系的な理解。すべてを分類し、分析したい。",
          "narrative_result": "あなたは、記憶の流れを一つずつ整理し始めた。あなたのかつての役割。ノメイアの歴史。名折れがなぜ起こったのか。それらのすべてが、あなたの理性によって分類され、分析されていった。ティアラは、そのあなたを見つめながら、かすかに笑った。「あなたは...本当に、変わらないんですね。どんな状況でも、分析する者」だが、その笑顔には、何か物足りなさがあるようにも見えた。",
          "affinity_delta": {
            "tiara_trust": 5,
            "logic_empathy_balance": -12,
            "name_memory_stability": 12,
            "fragment_count": 18
          }
        }
      ],
      "beacon_summary": "プレイヤーの正体が部分的に明かされ、ゲームの主要なプロット——『あなたは何者なのか』——への重大な進展が起こる。同時に、カケラ収集システムが、単なるサイドコンテンツではなく、プレイヤーの本質的な力の回復であることが示される。"
    },
    {
      "beacon_order": 5,
      "beacon_id": "chapter1_05_resolution",
      "title": "第一章の結末",
      "location": "ノメイア — 町の中央広場（再び）",
      "content": "あなたたちは、呼応石の光を携えて、ノメイアの町中央へと戻ってきた。\n\nその光は、町全体に優しく広がり始めた。\n\n薄れていた建物の輪郭が、再び鮮明になり始める。朧げだった人々の顔が、少しずつ確かな形をしていく。失われかけていた名前が、ゆっくりとではあるが、人々の心へと戻り始めた。\n\nある人は、突然に自分が『誰なのか』を思い出した。ある人は、かつての友人を見て、その名前を呼んだ。その瞬間、二人の間に、淡い光——呼応石の小さな欠片のような光——が灯った。\n\nノメイアは、少しずつ、しかし確実に、甦り始めていた。\n\nあなたは、ティアラを見た。\n\nティアラの瞳には、涙が溜まっていた。だが、それは悲しみの涙ではなく、喜びと、解放の涙だった。\n\n「ありがとう...」\n\nティアラは、小さく呟いた。\n\n「あなたが戻ってきてくれて...ありがとう...」\n\nあなたは、ティアラを抱き寄せた。\n\n「僕も...ありがとう...」\n\nあなたは、初めて、自分の声が『ああいう人間の声』だと実感した。記憶の中から、あなた自身の『声』が戻ってきたのだ。\n\nその時、あなたたちの周りで、すべてのカケラが光り始めた。\n\nそれは、失われた世界が、もう一度、つながりを取り戻しているのだ。\n\nティアラは、そっとあなたの手を握った。\n\n「第一章は、終わりました。でも...本当の物語は、ここからです。あなたは、まだ自分が『誰なのか』を、完全には思い出していません。そして、名折れが、なぜ起こったのか、その真実も...」\n\nあなたは、ティアラを見つめた。\n\n「一緒に、探そう...」\n\nあなたが、そう言うと、ティアラは、満面の笑みを浮かべた。\n\nそして、二人は、次の地へ向かって、歩みを進めていった。\n\n夜明けが近づき、ノメイアの空は、ゆっくりと色付き始めていた。",
      "tiara_dialogue": "「ありがとう...あなたが戻ってきてくれて...ありがとう...」（後に）「第一章は、終わりました。でも...本当の物語は、ここからです。あなたは、まだ自分が『誰なのか』を、完全には思い出していません」",
      "character_insights": {
        "tiara": "第一章の終わりで、ティアラはあなたへの愛と信頼を完全に表現する。同時に、物語がまだ始まったばかりであることを示唆し、第二章以降への扉を開く。",
        "echo": "プレイヤーは、自分の力が『光をもたらす力』であることを理解し、さらに『自分の声』を取り戻す。これは、名前記憶安定度の回復の象徴である。"
      },
      "choices": [
        {
          "choice_id": "ch1_resolution_commitment",
          "choice_text": "ティアラに誓う——『絶対に、また一緒に歩むから。絶対に、約束を守る』",
          "choice_description": "過去の誓いを再び確認する。未来への強い決意。",
          "narrative_result": "あなたが、その言葉を発した時、ティアラは激しく泣き始めた。だが、それは悲しみではなく、彼女がずっと、その言葉を待っていたことを示していた。「ええ...あなたは、昔もそう言いました...そして、あなたは、約束を守ってくれました...だから、もう一度...この時代に...あなたは、来てくれたんです」二人の絆は、その時、完全に一つになった。",
          "affinity_delta": {
            "tiara_trust": 25,
            "logic_empathy_balance": 15
          },
          "unlocks_content": ["chapter2_preview"]
        },
        {
          "choice_id": "ch1_resolution_question",
          "choice_text": "『本当は、何があったのか。全部、教えてくれ』と聞く",
          "choice_description": "謎への執着。理解したいという強い欲求。",
          "narrative_result": "ティアラは、一度深く息をついた。「全部は...まだ、いけません。でも...少しずつ、あなたが思い出すたびに、私は真実を添えていきます。それが、本当の『思い出す』ということなんです」その答えに、あなたは一定の満足は得たが、同時に、深い焦燥感も感じた。",
          "affinity_delta": {
            "tiara_trust": 8,
            "logic_empathy_balance": -8,
            "name_memory_stability": 5
          }
        },
        {
          "choice_id": "ch1_resolution_future",
          "choice_text": "ティアラと共に、これからへ目を向ける。『次は、どこへ行く？』",
          "choice_description": "過去より未来。この瞬間を大切にする。",
          "narrative_result": "ティアラは、静かに微笑んだ。「東へ...音の砂漠へ。そこには、あなたの『本当の名前』の欠片があるはずです。そして、名折れの真の原因も...」あなたたちは、新しい旅へと出発した。その背中には、ノメイアの光が、ずっと見守っていた。",
          "affinity_delta": {
            "tiara_trust": 12,
            "logic_empathy_balance": 10,
            "name_memory_stability": 8
          },
          "unlocks_content": ["chapter2_path"]
        }
      ],
      "beacon_summary": "第一章は、あなたの正体が部分的に明かされ、ティアラとの絆が最高潮に達した時点で、物語の第二幕へ向かうための準備として完結する。プレイヤーは、もはや『名前のない者』ではなく、『力を持つ者』として認識され始める。"
    }
  ]
}
